In [1]:
import pandas as pd

In [2]:
data = {
    "Name" : ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age" : [24, 27, 22, 32, 29],
    "Department" : ["HR", "Engineering", "Marketing", "Finance", "IT"],
    "Salary" : [50000, 60000, 55000, 70000, 65000]
}

In [3]:
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
 'Age': [24, 27, 22, 32, 29],
 'Department': ['HR', 'Engineering', 'Marketing', 'Finance', 'IT'],
 'Salary': [50000, 60000, 55000, 70000, 65000]}

In [4]:
df = pd.DataFrame(data)
df

      Name  Age   Department  Salary
0    Alice   24           HR   50000
1      Bob   27  Engineering   60000
2  Charlie   22    Marketing   55000
3    David   32      Finance   70000
4      Eva   29           IT   65000

In [7]:
df.iloc[1:3]

      Name  Age   Department  Salary
1      Bob   27  Engineering   60000
2  Charlie   22    Marketing   55000

In [9]:
df.loc[1:3, ["Name", "Salary"]]

      Name  Salary
1      Bob   60000
2  Charlie   55000
3    David   70000

In [10]:
df.drop("Age", axis=1, inplace=True)

In [11]:
df

      Name   Department  Salary
0    Alice           HR   50000
1      Bob  Engineering   60000
2  Charlie    Marketing   55000
3    David      Finance   70000
4      Eva           IT   65000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Department  5 non-null      object
 2   Salary      5 non-null      int64
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [13]:
df.describe()

            Salary
count      5.00000
mean   60000.00000
std     7905.69415
min    50000.00000
25%    55000.00000
50%    60000.00000
75%    65000.00000
max    70000.00000

In [14]:
df["Salary"] = df["Salary"] * 1.1
df

      Name   Department   Salary
0    Alice           HR  55000.0
1      Bob  Engineering  66000.0
2  Charlie    Marketing  60500.0
3    David      Finance  77000.0
4      Eva           IT  71500.0